Documents/Лео_УстановкаПланаПремииНепрямымКлиентам/Лео_УстановкаПланаПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаПланаПремииНепрямымКлиентам</name>
  <registerRecords>AccumulationRegister.Лео_ПланФактПримииНепрямымКлиентам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товарооборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/Лео_ПланФактПримииНепрямымКлиентам/Лео_ПланФактПримииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ПланФактПримииНепрямымКлиентам</name>
  <resources>
    <name>Товарооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Documents/Лео_УстановкаПланаПремииНепрямымКлиентам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Записывать = Истина;
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Очистить();
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.Лео_ПланФактПримииНепрямымКлиентам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрокаПлан.НачалоПериода;
		Движение.Контрагент = ТекСтрокаПлан.Контрагент;
		Движение.Сеть = ТекСтрокаПлан.Сеть;
		Движение.ТорговаяТочка = ТекСтрокаПлан.ТорговаяТочка;
		Движение.Товарооборот = ТекСтрокаПлан.Товарооборот;
		Движение.ФиксированнаяСумма = ТекСтрокаПлан.ФиксированнаяСумма;
		Движение.Премия = ТекСтрокаПлан.Премия;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка() Тогда
		 Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
